[

	{"name": "The Hateful Eight", "year": 2015, "review": "As Tarantino as it gets, but not the best parts of Tarantino. The story of a bounty hunter bringing in his bounty. Along his journey to the town where his bounty - Daisy Domergue (Jennifer Jason Leigh) - will be hanged, John Ruth (Kurt Russell) encounters two travelers in need of a lift, as well as a couple more strangers in the cabin where they need to shelter from the blizzard that passes over. Ruth cannot trust anybody as they might be plotting to either take Daisy to secure her bounty for themselves, or be interested in freeing her. A grand who-done-it ensues with copious amounts of violence, as well as dialog - in true Tarantino style. The way the story is told - jumping back and forth in order to first confuse and surprise the audience, and then follow by jumping backwards to explain the events that were surprising - is excellently done, and probably the most appealing aspect of this movie, as well as the quality of the acting from all the roles involved. Other than that, it's just a shallow Tarantino build-up-then-gore film with 'real' dialog."},

	{"name": "Steve Jobs", "year": 2015, "review": "Impresively choreographed depiction of a character. We see jobs' life through the events of his product launches, beginning with the first mac. Though he is portrayed as a genius, and a perfectionist, focusing on many an excruciatingly specific detail regarding the various product launches, we also get to see his delusions, his pitfalls as a father, his denial of being a father, the way he treats his employees and friends. Michael Fassbender is amazing here, as well as Kate Winslet, who plays Jobs' trusted, Eastern European Advisor."},
	
	{"name": "The Revenant", "year": 2015, "review": "An epic story of how a man survives in spite of the odds, and a story of revenge. Explorers of America newly after its discovery involved in fur trading are ambushed during some expedition by Indians and lose most of their men. A handful make it to their boat and start the journey back to their base. Hugh Glass (Leonardo DiCaprio) is in charge of navigation for the company, he knows the land because of his close ties with the Indians - his wife was an Indian, but died. His son is with him and his company. Glass gets badly injured by a bear and is left behind with only two men and his son to watch him while he recovers. John Fitzgerald (Tom Hardy) is worried about the Indians finding them and kills Glass' son while convincing the other man (Bridger) that he had disappeared, and that they had to leave Glass, which they did, for dead. Glass makes it back to camp, through multiple miracles, and heads out to find the fleeing Fitzgerald, who he saw murder his son. Beautifully shot film, cinematography in the clean, snowy mountains contrasts with the gritty, fleshiness of the characters - always on the ground, in the dirt. "},

	{"name": "Spotlight", "year": 2015, "review": "The story of the Boston Globe uncovering the scandal of child molestation within the Catholic Church. This story shows the way the church controlled everyone and everything, how it was placed above the law, and how people were willing to turn a blind eye, or even rationalize what was happening based on the status of the church. Exceptionally well told story with great acting by all lead and supporting roles."},

	{"name": "The Big Short", "year": 2015, "review": "Based on the true story of how a handful of people predicted the financial market crash of the mid 2000s caused by the credit and housing bubble collapse. A shocking story, very surprisingly true, if seen though the lens of the characters that predicted the crash. Excellent narrative of the different characters' stories and how they became involved. Clever digressions (sometimes breaking the 4th wall) used to explain financial terms such that audiences wouldn't become bored or intimidated. Very well acted, Steve Carell in particular, who plays Mark Baum, a man angry at the way society exploits the weak and vulnerable for the benefit of the rich. He just wants to see the wealthy, corrupt, most high up members in the corporate ladder fall to their demise."},

	{"name": "Joy", "year": 2015, "review": "Joy is a women who has had the spark inside of her all but blown out by the various troubles of her life that she has been faced with. Her responsibilities and obligations burden her to the point of near collapse, but she re-ignites her spark and draws a design for a mop with her daughter's crayons. She eventually becomes a huge success in selling products across America, owning over 100 patents, an empire. The story is not told in a very captivating or consistent way, with characters coming in and out for seemingly no reason, and mood changing from scene to scene often without connection or explanation. Not one of my favourite David O Russel films."},


	{"name": "Rocky", "year": 1976, "review": "The Italian Stallion. Is this the first underdog movie there is? If so it inspired basically a whole genre. It's weird watching old movies that were pioneering a way of story telling that you are already so used to. It's quite difficult to appreciate the originality once the idea has been used so many times since. Was very well shot and showed the city of Philadelphia in an interesting way; the dark, dingy, lower-class aspect in Rocky and all his friends' lives contrasted with the upper-class world of Apollo Creed and his 'equals'. Carl Weathers, who played Creed, was excellent. Was a vision of the famous Hare that lost to the Tortoise. Paulie the meat man, played by Burt Young was also great; loved his sad-clown character. Rocky's girlfriend, Adrian, played by Talia Shire was quite disappointed, but I suppose it's hard to expect anything from a female supporting role from 1976. She was only there to boost Rocky's character. It was a very good performance nonetheless."},

	{"name": "Moon", "year": 2009, "review": "I really like Sam Rockwell. And he had this whole movie to himself, bar the computer GERTY played by Kevin Spacey. Sam plays a clone, or rather two clones, of Sam Bell. He's in charge of managing a station on the moon that mines helium and sends it back to earth for fusion energy. Was interesting to see Rockwell playing two clones as different people. GERTY the computer helped one of the clones get back to earth, where the movie ends. It's nice to see a movie where AI is actually helping the protagonists instead of turning against them. Quite a unexpected and refreshing reversal there."},

	{"name": "Casablanca", "year": 1942, "review": "'Here's to you kid.'' Humphrey Bogart as Rick Blaine is as cold as ice, except of course, when melted by the stunning Ingrid Berman playing Ilsa Kund. This movie is a huge plate of fantasy and Romance, with small portions of comedy, violence and even politics. It covers too many areas, one might think, such as to disallow itself to delve too deeply  into any one in particular. It's a romance at heart, but there's not much to it. A blockbuster of the 1940's I guess."},

	{"name": "Carol", "year": 2015, "review": "Rooney Mara is really good in this as Therese Belivet; a shy, young shop attendant who comes to terms with her sexual orientation in a difficult (more difficult) time. Carol, played by Cate Blanchett, is a slightly older woman who is  married with a young child. She has to risk her relationship with her daughter in order to have any kind of meaningful relationship with Therese; which in the end cannot work. Very melancholic."},

	{"name": "Love", "year": 2015, "review": "Gaspar Noe is so stylistic. I thoroughly enjoyed Enter the Void (2009) and this movie does not fall much short of the almost stream-of-consciousness feel of his most well known film. Murphy is an American living in Paris who ruins his relationship with his Parisian girlfriend Electra, by pursuing a younger girl Omi, who he and Electra meet together and invite to their bed as a couple. Murphy ends up fathering a child with Omi, who looks for meaning in her relationship with Murphy, but Murphy longs for Electra and is doomed by having to live with Omi in an empty, loveless home. Maybe he can learn to love Omi, but not like he loved, still loves Electra."},

	{"name": "Brooklyn", "year": 2015, "review": "Wonderful film! Eilis, a young Irish woman who is sponsored to emigrate to America, where she can start a new life away from the old, non-promising town where she's lived her whole life in Ireland. She leaves her Mother and Sister behind and is torn between a new life and her old one. The death of her sister comes at a time when Eilis has settled well in Brooklyn and married a young Italian. She returns to Ireland and is plagued by the decision she must make; whether she must stay in Ireland, or go back to her life she has made in America. The decision isn't made easy and the film captures this girls struggle so beautifully well."},

	{"name": "Blue is the Warmest Color", "year": 2013, "review": "The story begins with a young French girl, Adele, who is first discovering her sexuality. She quickly realizes that she is attracted to both men and women. She meets a mysterious, beautiful, art student Emma after following her into a bar one night and they instantly connect. A passionate love story ensues, whereby their lives fluctuate and events in the relationship unfold in a natural way. They settle. Adele cheats on Emma because she starts to feel lonely as Emma spends most of her time on her art. Emma completely rejects Adele who is devastated, crushed. The film ends with the closure of Adele accepting that she will never be with Emma again, and moving on. Amazing told story that is shot and acted beautifully. Léa Seydoux who plays Emma is brilliant."},

	{"name": "Dear Zachary: A Letter to a Son About His Father", "year": 2008, "review": "A tragic documentary of the murder of a son and a grandchild. Andrew and Zachary Bragby. Originally filmed with Zachary as the intended audience, telling the story of his dad's wonderful life and tragic death. It takes a turn when Zachary is murdered by the same person who shot his father; a psychotic ex-girlfriend, who is pregnant with Zachary at the time of Andrew's death. The story is told through the voices and memories of all of Andrew's friends and family, people who all regard Andrew as a wonderful person, all of who's lives were touched by Andrew. His childhood friend Kurt Kuenne directs and narrates the story. Incredibly sad, heart-wrenching movie."}

]	